import random
from faker import Faker

referral_reason = [
    """בירור כאבי בטן כרוניים""",
    f"""מעקב אחר {random.choice(['מצב ידוע של ', 'חשד ל'])}אבנים בכליות""",
    """הפרעות בתפקודי כבד""",
    """חשד לדלקת במעי""",
    """בירור""",
    """דלקת?""",
    """הפנייה ממיון""",
    """בדיקה לאחר חבלה""",
    """חשש לתהליך דלקתי בבטן""",
    """סקירה כללית בשל כאבים לא מוסברים""",
    """דלקת באפנדציט""",
    """תלונה על בחילות וכאבי בטן עזים""",
    """נפיחות בטנית לא מוסברת""",
    """"""  # Allow empty string for diversity
]
date_time_patterns = ["DAY/%m/%Y", "DAY-%m-%Y", "DAY.%m.%Y", "DAY/%m/%y"]


def get_anonymized_date():
    fake = Faker('he_IL')
    date = fake.date_time_this_century()
    current_date_time = date.strftime(random.choice(date_time_patterns))
    current_date_time = current_date_time.replace("DAY", """<יום_>""")
    return current_date_time


prev_date_options = [
    f"""לא קיימת במערכת בדיקה קודמת {random.choice(['להשוואה', 'לצורך השוואה', ''])}""",
    f"""בוצעה השואה לבדיקה קודמת מתאריך <תאריך_>""",
    f"""בוצאה השוואה לבדיקה קודמת מתאריך <תאריך_>""",
    f"""בוצעה השוואה לבדיקה מתאריך <תאריך_>""",
    f"""בוצעה השוואה לבדיקת PET CT מתאריך <תאריך_>""",
    f"""בוצעה השואה לבדיקת PET CT מה<תאריך_>""",
    f"""בוצעה השוואה לבדיקה מה<תאריך_>""",
]
header = [
    f""" סיבת הפניה: {random.choice(referral_reason)} """,
    """תוצאות סריקת CT בטן ואגן:""",
    """פענוח סריקת הבטן והאגן:""",
    f"""ממצאי סריקה טומוגרפית {random.choice(['ללא', 'לפני', 'אחרי'])} הזרקת חומר ניגוד.""",
    f"""להלן ממצאי סריקה טומוגרפית {random.choice(['ללא', 'לפני', 'אחרי'])} הזרקת חומר ניגוד.""",
    f"""ט.מ. בטן ואגן: {random.choice(referral_reason)}"""
]

size_uint = ["""סמ""", """ס"מ""", """ממ""", """מ"מ"""]
size = [f"{random.randrange(1, 16)}", f"{round(random.uniform(0.1, 15.5), 2)}"]

lung_location = [
    f"""בסיס ריאה {random.choice(['שמאלית', 'ימנית', 'ימין', 'שמאל'])}""",
    f"""בסיס ראה {random.choice(['שמאלית', 'ימנית', 'ימין', 'שמאל'])}""",
    f"""{random.choice(['RLL', 'RUL', 'RML', 'LUL', 'LLL'])}""",
    """שדות הריאה""",
    """שדות הראה""",
    """פסגות הריאה""",
    f"""פסגת הריאה ה{random.choice(['שמאלית', 'ימנית'])}"""
]
prev_results = [
    """ללא שינוי """,
    """אין שינוי """,
    """לא נראה שינוי """,
    """ללא שינוי מבדיקה קודמת""",
    """חדש לעומת סריקה קודמת""",
    """חדש (לעומת הסריקה הקודמת)""",
    """-חדש""",
    """-החמרה מבדיקה קודמת""",
    """-החמרה- מבדיקה קודמת""",
    ""
]

individual_finding = [
    """נודול""",
    """נןדול""",
    """נודןל""",
    """נודול תת פלאורלי""",
    """נודול תת-פלאורלי""",
    """נודול תת פלא ורלי""",
    """ממצא""",
    """מימצא""",
    """תהליך""",
    """תהלייך""",
    """מוקד""",
    """מןקד"""
]
many_findings = [
    """נודולים""",
    """נןדולים""",
    """נודןלים""",
    """נודולים תת פלאורלי""",
    """נודולים תת-פלאורלי""",
    """ממצאים תת פלאורלים""",
    """מוקדים תת פליאורליים""",
    """ממצאים""",
    """תהליכים""",
    """תהליחים""",
    """תהילכים""",
    """מןקדים""",
    """מוקדים"""
]

findings = [
    f"""<ממצא_> בקוטר <גודל_> ב{random.choice(lung_location)} {random.choice(prev_results)}""",
    f"""<ממצא_> בגודל <גודל_> ב{random.choice(lung_location)} {random.choice(prev_results)}""",
    f"""<ממצא_> ב{random.choice(lung_location)} {random.choice(prev_results)}""",
    f"""<ממצאים_> הגדול שבהם בקוטר <גודל_> ב{random.choice(lung_location)} {random.choice(prev_results)}""",
    f"""<ממצאים_> ב{random.choice(lung_location)} {random.choice(prev_results)}""",
]

recommendations = [
    f"""מומלץ מעקב פולמונולוגי טווח קצר""",
    f"""מומלץ מעקב פולמונולוגי""",
    f"""מומלץ המשך בירור הדמייתי ע"י סיטי חזה""",
    f"""מומלץ לבצע CT חזה""",
    f"""מומלץ להשלים CT חזה""",
    f"""למעקב רופא ריאות""",
    f"""מומלץ לבצע בדיקת CT חזה""",
]

lungs_indication = [
    f"""מעבר חזה בטן {random.choice(findings)}""",
    f"""במעבר חזה בטן נצפו שינויים פיברוטיים. {random.choice(findings)}""",
    f"""במעבר חזה בטן הודגם {random.choice(findings)}""",
    f"""מעבר חזה בטן תקין""",
    f"""מעבר חזה בטן ללא ממצא מוקדי ללא תפליט פלאורלי""",
    f"""מעבר חזה בטן {random.choice(findings)} . {random.choice(findings)} .""",
]

CTAbdomenAndPelvis = [
    f"""
    {random.choice(header)} {random.choice(lungs_indication)} 
     {random.choice(['ללא סימני הידרונפרוזיס. ללא אבנים.', "הכליה הימנית בגודל ומנח תקינים,", f'נצפתה אבן בקוטר {random.choice(size)} {random.choice(size_uint)} באגן הכליה הימני.'])}
אורטר ימני עדין לכל אורכו.
{random.choice(['ללא סימני הידרונפרוזיס. ללא אבנים.', "הכליה השמאלית בגודל ומנח תקינים, ", f'באגן הכליה השמאלית תהליך אגזופיטי בלתי אחיד בקוטר {random.choice(size)} {random.choice(size_uint)}.'])}
אורטר שמאלי עדין לכל אורכו.
שלפוחית השתן {random.choice(['במילוי חלקי.', 'במילוי מלא.', "תקינה"])}
ערמונית {random.choice(['אינה מוגדלת.', "מוגדלת", 'מוגדלת במידה קלה.'])}
<המלצה_>
""",
    f"""
    {random.choice(header)} {random.choice(lungs_indication)} ללא נוזל בבטן ובאגן.
    ללא לימפאדנופתיה רטרופריטונאלית, אגנית ומפשעתית.
הכבד, הטחול, הלבלב והאדרנלים ללא ממצא פוקאלי גס בהסתייגות שלא הוזרק חומר ניגודי.
מבנה גרמי- {random.choice(['שינויים ניווניים קלים בע"ש.', 'ללא שינויים גרמיים.'])}
""",
    f"""
    {random.choice(header)} {random.choice(lungs_indication)} <המלצה_> 
    הטחול {random.choice(['בגודל ומרקם תקינים.', f'מוגדל עד {random.choice(size)} {random.choice(size_uint)}, מרקם הומוגני.'])}
אדרנלים {random.choice(['ללא ממצא פתולוגי.', 'מוגדלים מעט עם נודולים קטנים.', "בגודל תקין "])}
הכליות {random.choice(['בגודל ומנח תקינים, ללא אבנים.', 'מכילות אבנים קטנות בשתי הכליות.'])}
ללא לימפאדנופתיה רטרופריטונאלית.
 {random.choice(['ללא עיבוי דופן או נגעים במעי.', 'הודגם עיבוי קל בדופן המעי הדק.'])}
שלפוחית השתן {random.choice(['במילוי תקין.', 'מלאה חלקית.', "בגודל ומילוי תקין."])}
אברי האגן {random.choice(['בגודל ומבנה תקינים.', 'תקינים ללא ממצאים חריגים.'])}
{random.choice(['ללא ממצאים חריגים במבנה הגרמי.', 'שינויים ניווניים קלים בעמוד השדרה.', "שינוים גרמיים חשודים."])}
""",
    f"""
{random.choice(header)} {random.choice(lungs_indication)}
הכבד {random.choice(['תקין בגודלו ובמבנהו.', "נראה תקין ללא שינוי.", 'בעל מרקם הטרוגני עם עדות להסננה שומנית.'])}
כיס המרה {random.choice(['שמור ותקין', 'חשד לאבן קטנה.', "עם אבן ידועה"])}
הטחול {random.choice(['בגודל ומרקם תקינים.', f' מוגדל עד{random.choice(size)} {random.choice(size_uint)}'])}
בסריקה הלבלב נראה {random.choice(['במבנה ומרקם תקינים.', 'עם שינויים דיפוזיים.'])}
אדרנלים {random.choice(['ללא ממצא פתולוגי.', 'עם הצללות חשודות- לברר.'])}
כליות {random.choice(['בגודל ומנח תקינים, ללא אבנים.', 'מכילות אבנים קטנות(ידועות).'])}
מעי הדק {random.choice(['ללא עיבוי דופן או נגעים.', 'הודגם עיבוי קל בדופן.'])}
המעי הגס {random.choice(['ללא תהליכים מוקדיים.', f'נראתה פוליפ בגודל {random.choice(size)} {random.choice(size_uint)} בסיגמה.'])}
מבנה גרמי {random.choice(['ללא שינויים פתולוגיים.', 'עם שינויים ניווניים קלים.'])}
""",
    f"""
כיס מרה, טחול, לבלב, כליות ואדרנלים תקינים.
{random.choice(lungs_indication)} 
מודגם אזור קטן של התפשלות מעי דק בבטן השמאלית באמצע, ללא סימני חסימה.
כלי הדם הגדולים ללא ממצא משמעותי.
לאחר כריתת רחם.
סיכום: <המלצה_>
"""
]
